RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_adc_ex.h
/**
  * @brief Ensure ADC Instance is Independent or Master, or is not Slave ADC with dual injected conversions enabled
  * @param __HANDLE__: ADC handle
  * @retval SET (non-MultiMode or Master, or Slave without dual injected conversions enabled) or RESET (Slave ADC with dual injected conversions enabled)
  */
#define ADC_INDEPENDENT_OR_NONMULTIMODEINJECTED_SLAVE(__HANDLE__)         \
  ( ( ((__HANDLE__)->Instance == ADC1) || ((__HANDLE__)->Instance == ADC3) \
    )?                                                                     \
     SET                                                                   \
     :                                                                     \
     ( ((ADC12_COMMON->CCR & ADC_CCR_DUAL) == ADC_MODE_INDEPENDENT)    || \
       ((ADC12_COMMON->CCR & ADC_CCR_DUAL) == ADC_DUALMODE_REGSIMULT)  || \
       ((ADC12_COMMON->CCR & ADC_CCR_DUAL) == ADC_DUALMODE_INTERL) ))

/**
  * @brief Verification of ADC state: enabled or disabled, directly checked on instance as input parameter
  * @param __INSTANCE__: ADC instance
  * @retval SET (ADC enabled) or RESET (ADC disabled)
  */
#define ADC_INSTANCE_IS_ENABLED(__INSTANCE__)                                                    \
       (( ((((__INSTANCE__)->CR) & (ADC_CR_ADEN | ADC_CR_ADDIS)) == ADC_CR_ADEN) && \
          ((((__INSTANCE__)->ISR) & ADC_FLAG_RDY) == ADC_FLAG_RDY)                  \
        ) ? SET : RESET)

/**
  * @brief Verification of enabled/disabled status of ADCs other than that associated to the input parameter handle
  * @param __HANDLE__: ADC handle
  * @retval SET (at least one other ADC is enabled) or RESET (no other ADC is enabled, all other ADCs are disabled)
  */
#define ADC_ANY_OTHER_ENABLED(__HANDLE__)           \
  ( ( ((__HANDLE__)->Instance == ADC1)                                         \
    )?                                                                         \
     (ADC_INSTANCE_IS_ENABLED(ADC2)) || (ADC_INSTANCE_IS_ENABLED(ADC3))  \
     :                                                                         \
     ( ( ((__HANDLE__)->Instance == ADC2)                                      \
       )?                                                                      \
         (ADC_INSTANCE_IS_ENABLED(ADC1)) || (ADC_INSTANCE_IS_ENABLED(ADC3))  \
        :                                                                      \
          ADC_INSTANCE_IS_ENABLED(ADC1)) || (ADC_INSTANCE_IS_ENABLED(ADC2))    \
     )                                                                         \

/**
  * @brief Set handle instance of the ADC slave associated to the ADC master
  * @param __HANDLE_MASTER__: ADC master handle
  * @param __HANDLE_SLAVE__: ADC slave handle
  * @note if __HANDLE_MASTER__ is the handle of a slave ADC (ADC2) or an independent ADC (ADC3), __HANDLE_SLAVE__ instance is set to NULL
  * @retval None
  */
#define ADC_MULTI_SLAVE(__HANDLE_MASTER__, __HANDLE_SLAVE__)             \
  ( (((__HANDLE_MASTER__)->Instance == ADC1)) ? ((__HANDLE_SLAVE__)->Instance = ADC2) : ((__HANDLE_SLAVE__)->Instance = NULL) )

/**
  * @brief Verify the ADC single-ended input or differential mode setting.
  * @param SING_DIFF: programmed channel setting. 
  * @retval SET (SING_DIFF is valid) or RESET (SING_DIFF is invalid)
  */
#define IS_ADC_SINGLE_DIFFERENTIAL(SING_DIFF) (((SING_DIFF) == ADC_SINGLE_ENDED)      || \
                                               ((SING_DIFF) == ADC_DIFFERENTIAL_ENDED)  )

/**
  * @brief Verify the ADC offset management setting.
  * @param OFFSET_NUMBER: ADC offset management. 
  * @retval SET (OFFSET_NUMBER is valid) or RESET (OFFSET_NUMBER is invalid)
  */
#define IS_ADC_OFFSET_NUMBER(OFFSET_NUMBER) (((OFFSET_NUMBER) == ADC_OFFSET_NONE) || \
                                             ((OFFSET_NUMBER) == ADC_OFFSET_1)    || \
                                             ((OFFSET_NUMBER) == ADC_OFFSET_2)    || \
                                             ((OFFSET_NUMBER) == ADC_OFFSET_3)    || \
                                             ((OFFSET_NUMBER) == ADC_OFFSET_4)      )

/**
  * @brief Verify the ADC injected channel setting.
  * @param CHANNEL: programmed ADC injected channel. 
  * @retval SET (CHANNEL is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_INJECTED_RANK(CHANNEL) (((CHANNEL) == ADC_INJECTED_RANK_1) || \
                                       ((CHANNEL) == ADC_INJECTED_RANK_2) || \
                                       ((CHANNEL) == ADC_INJECTED_RANK_3) || \
                                       ((CHANNEL) == ADC_INJECTED_RANK_4)   )

/**
  * @brief Verify the ADC injected conversions external trigger.
  * @param INJTRIG: programmed ADC injected conversions external trigger.
  * @retval SET (INJTRIG is a valid value) or RESET (INJTRIG is invalid)
  */ 
#define IS_ADC_EXTTRIGINJEC(INJTRIG) (((INJTRIG) == ADC_EXTERNALTRIGINJEC_T1_TRGO)     || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T1_CC4)      || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T2_TRGO)     || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T2_CC1)      || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T3_CC4)      || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T4_TRGO)     || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_EXT_IT15)    || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T8_CC4)      || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T1_TRGO2)    || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T8_TRGO)     || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T8_TRGO2)    || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T3_CC3)      || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T3_TRGO)     || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T3_CC1)      || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T6_TRGO)     || \
                                      ((INJTRIG) == ADC_EXTERNALTRIGINJEC_T15_TRGO)    || \
                                                                                          \
                                      ((INJTRIG) == ADC_SOFTWARE_START)                   )

/**
  * @brief Verify the ADC edge trigger setting for injected group.
  * @param EDGE: programmed ADC edge trigger setting.
  * @retval SET (EDGE is a valid value) or RESET (EDGE is invalid)
  */ 
#define IS_ADC_EXTTRIGINJEC_EDGE(EDGE) (((EDGE) == ADC_EXTERNALTRIGINJECCONV_EDGE_NONE)         || \
                                        ((EDGE) == ADC_EXTERNALTRIGINJECCONV_EDGE_RISING)       || \
                                        ((EDGE) == ADC_EXTERNALTRIGINJECCONV_EDGE_FALLING)      || \
                                        ((EDGE) == ADC_EXTERNALTRIGINJECCONV_EDGE_RISINGFALLING)  )

/**
  * @brief Verify the ADC multimode setting.
  * @param MODE: programmed ADC multimode setting.
  * @retval SET (MODE is valid) or RESET (MODE is invalid)
  */ 
#define IS_ADC_MODE(MODE) (((MODE) == ADC_MODE_INDEPENDENT)               || \
                           ((MODE) == ADC_DUALMODE_REGSIMULT_INJECSIMULT) || \
                           ((MODE) == ADC_DUALMODE_REGSIMULT_ALTERTRIG)   || \
                           ((MODE) == ADC_DUALMODE_REGINTERL_INJECSIMULT) || \
                           ((MODE) == ADC_DUALMODE_INJECSIMULT)           || \
                           ((MODE) == ADC_DUALMODE_REGSIMULT)             || \
                           ((MODE) == ADC_DUALMODE_INTERL)                || \
                           ((MODE) == ADC_DUALMODE_ALTERTRIG)               )

/**
  * @brief Verify the ADC dual data mode setting.
  * @param MODE: programmed ADC dual mode setting.
  * @retval SET (MODE is valid) or RESET (MODE is invalid)
  */
#define IS_ADC_DUAL_DATA_MODE(MODE) (((MODE) == ADC_DUALMODEDATAFORMAT_DISABLED)   || \
                                     ((MODE) == ADC_DUALMODEDATAFORMAT_32_10_BITS) || \
                                     ((MODE) == ADC_DUALMODEDATAFORMAT_8_BITS)     )

/**
  * @brief Verify the ADC multimode delay setting.
  * @param DELAY: programmed ADC multimode delay setting.
  * @retval SET (DELAY is a valid value) or RESET (DELAY is invalid)
  */
#define IS_ADC_SAMPLING_DELAY(DELAY) (((DELAY) == ADC_TWOSAMPLINGDELAY_1CYCLE)   || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_2CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_3CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_4CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_5CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_6CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_7CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_8CYCLES)  || \
                                      ((DELAY) == ADC_TWOSAMPLINGDELAY_9CYCLES))

/**
  * @brief Verify the ADC analog watchdog setting.
  * @param WATCHDOG: programmed ADC analog watchdog setting.
  * @retval SET (WATCHDOG is valid) or RESET (WATCHDOG is invalid)
  */
#define IS_ADC_ANALOG_WATCHDOG_NUMBER(WATCHDOG) (((WATCHDOG) == ADC_ANALOGWATCHDOG_1) || \
                                                 ((WATCHDOG) == ADC_ANALOGWATCHDOG_2) || \
                                                 ((WATCHDOG) == ADC_ANALOGWATCHDOG_3)   )

/**
  * @brief Verify the ADC analog watchdog mode setting.
  * @param WATCHDOG: programmed ADC analog watchdog mode setting.
  * @retval SET (WATCHDOG is valid) or RESET (WATCHDOG is invalid)
  */
#define IS_ADC_ANALOG_WATCHDOG_MODE(WATCHDOG) (((WATCHDOG) == ADC_ANALOGWATCHDOG_NONE)             || \
                                               ((WATCHDOG) == ADC_ANALOGWATCHDOG_SINGLE_REG)       || \
                                               ((WATCHDOG) == ADC_ANALOGWATCHDOG_SINGLE_INJEC)     || \
                                               ((WATCHDOG) == ADC_ANALOGWATCHDOG_SINGLE_REGINJEC)  || \
                                               ((WATCHDOG) == ADC_ANALOGWATCHDOG_ALL_REG)          || \
                                               ((WATCHDOG) == ADC_ANALOGWATCHDOG_ALL_INJEC)        || \
                                               ((WATCHDOG) == ADC_ANALOGWATCHDOG_ALL_REGINJEC)       )

/**
  * @brief Verify the ADC conversion (regular or injected or both).
  * @param CONVERSION: ADC conversion group.
  * @retval SET (CONVERSION is valid) or RESET (CONVERSION is invalid)
  */#define IS_ADC_CONVERSION_GROUP(CONVERSION) (((CONVERSION) == ADC_REGULAR_GROUP)         || \
                                                 ((CONVERSION) == ADC_INJECTED_GROUP)        || \
                                                 ((CONVERSION) == ADC_REGULAR_INJECTED_GROUP)  )

/**
  * @brief Verify the ADC event type.
  * @param EVENT: ADC event.
  * @retval SET (EVENT is valid) or RESET (EVENT is invalid)
  */
#define IS_ADC_EVENT_TYPE(EVENT) (((EVENT) == ADC_EOSMP_EVENT) || \
                                  ((EVENT) == ADC_AWD_EVENT)   || \
                                  ((EVENT) == ADC_AWD2_EVENT)  || \
                                  ((EVENT) == ADC_AWD3_EVENT)  || \
                                  ((EVENT) == ADC_OVR_EVENT)   || \
                                  ((EVENT) == ADC_JQOVF_EVENT)  )

/**
  * @brief Verify the ADC scan mode.
  * @param SCAN_MODE: ADC scan mode.
  * @retval SET (SCAN_MODE is valid) or RESET (SCAN_MODE is invalid)
  */
#define IS_ADC_SCAN_MODE(SCAN_MODE) (((SCAN_MODE) == ADC_SCAN_DISABLE) || \
                                     ((SCAN_MODE) == ADC_SCAN_ENABLE)    )

/**
  * @brief Verify the ADC oversampling ratio. 
  * @param RATIO: programmed ADC oversampling ratio.
  * @retval SET (RATIO is a valid value) or RESET (RATIO is invalid)
  */
#define IS_ADC_OVERSAMPLING_RATIO(RATIO)  ((RATIO) < 1024)

/**
  * @brief Verify the ADC oversampling right shift. 
  * @param SHIFT: programmed ADC oversampling right shift.
  * @retval SET (SHIFT is a valid value) or RESET (SHIFT is invalid)
  */
#define IS_ADC_RIGHT_BIT_SHIFT(SHIFT)               (((SHIFT) == ADC_RIGHTBITSHIFT_NONE) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_1   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_2   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_3   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_4   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_5   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_6   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_7   ) || \
                                                     ((SHIFT) == ADC_RIGHTBITSHIFT_8   ))

/**
  * @brief Verify the ADC oversampling left shift. 
  * @param SHIFT: programmed ADC oversampling left shift.
  * @retval SET (SHIFT is a valid value) or RESET (SHIFT is invalid)
  */
#define IS_ADC_LEFT_BIT_SHIFT(SHIFT)                (((SHIFT) == ADC_LEFTBITSHIFT_NONE) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_1   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_2   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_3   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_4   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_5   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_6   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_7   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_8   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_9   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_10   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_11   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_12   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_13   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_14   ) || \
                                                     ((SHIFT) == ADC_LEFTBITSHIFT_15   ))

/**
  * @brief Verify the ADC oversampling triggered mode. 
  * @param MODE: programmed ADC oversampling triggered mode. 
  * @retval SET (MODE is valid) or RESET (MODE is invalid)
  */ 
#define IS_ADC_TRIGGERED_OVERSAMPLING_MODE(MODE) (((MODE) == ADC_TRIGGEREDMODE_SINGLE_TRIGGER) || \
                                                  ((MODE) == ADC_TRIGGEREDMODE_MULTI_TRIGGER) )

/**
  * @brief Verify the ADC oversampling regular conversion resumed or continued mode. 
  * @param MODE: programmed ADC oversampling regular conversion resumed or continued mode. 
  * @retval SET (MODE is valid) or RESET (MODE is invalid)
  */ 
#define IS_ADC_REGOVERSAMPLING_MODE(MODE) (((MODE) == ADC_REGOVERSAMPLING_CONTINUED_MODE) || \
                                           ((MODE) == ADC_REGOVERSAMPLING_RESUMED_MODE) )

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADCEx_Exported_Functions ADC Extended Exported Functions
  * @{
  */

/* Initialization/de-initialization functions *********************************/

/** @addtogroup ADCEx_Exported_Functions_Group1 Extended Input and Output operation functions
  * @brief    Extended IO operation functions
  * @{
  */
/* I/O operation functions ****************************************************/

/* ADC calibration */

HAL_StatusTypeDef       HAL_ADCEx_Calibration_Start(ADC_HandleTypeDef* hadc, uint32_t CalibrationMode, uint32_t SingleDiff);
uint32_t                HAL_ADCEx_Calibration_GetValue(ADC_HandleTypeDef *hadc, uint32_t SingleDiff);
HAL_StatusTypeDef       HAL_ADCEx_LinearCalibration_GetValue(ADC_HandleTypeDef* hadc, uint32_t* LinearCalib_Buffer);
HAL_StatusTypeDef       HAL_ADCEx_Calibration_SetValue(ADC_HandleTypeDef *hadc, uint32_t SingleDiff, uint32_t CalibrationFactor);
HAL_StatusTypeDef       HAL_ADCEx_LinearCalibration_SetValue(ADC_HandleTypeDef *hadc, uint32_t* LinearCalib_Buffer);


/* Blocking mode: Polling */
HAL_StatusTypeDef       HAL_ADCEx_InjectedStart(ADC_HandleTypeDef* hadc);
HAL_StatusTypeDef       HAL_ADCEx_InjectedStop(ADC_HandleTypeDef* hadc);
HAL_StatusTypeDef       HAL_ADCEx_InjectedPollForConversion(ADC_HandleTypeDef* hadc, uint32_t Timeout);

/* Non-blocking mode: Interruption */
HAL_StatusTypeDef       HAL_ADCEx_InjectedStart_IT(ADC_HandleTypeDef* hadc);
HAL_StatusTypeDef       HAL_ADCEx_InjectedStop_IT(ADC_HandleTypeDef* hadc);


/* ADC multimode */
HAL_StatusTypeDef       HAL_ADCEx_MultiModeStart_DMA(ADC_HandleTypeDef *hadc, uint32_t *pData, uint32_t Length);
HAL_StatusTypeDef       HAL_ADCEx_MultiModeStop_DMA(ADC_HandleTypeDef *hadc);
uint32_t                HAL_ADCEx_MultiModeGetValue(ADC_HandleTypeDef *hadc);


